In [1]:
import pandas as pd
import numpy as np

In [11]:
data = pd.read_csv('cleaned_calendarData.csv')
data

           Date
0    2022-01-01
1    2022-01-02
2    2022-01-03
3    2022-01-04
4    2022-01-05
..          ...
633  2023-09-26
634  2023-09-27
635  2023-09-28
636  2023-09-29
637  2023-09-30

[638 rows x 1 columns]

In [12]:
data.head()

         Date
0  2022-01-01
1  2022-01-02
2  2022-01-03
3  2022-01-04
4  2022-01-05

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 638 entries, 0 to 637
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Date    638 non-null    object
dtypes: object(1)
memory usage: 5.1+ KB

In [15]:
data.shape

(638, 1)

In [16]:
data.describe()

              Date
count          638
unique         638
top     2022-01-01
freq             1

In [17]:
data.nunique

<bound method DataFrame.nunique of            Date
0    2022-01-01
1    2022-01-02
2    2022-01-03
3    2022-01-04
4    2022-01-05
..          ...
633  2023-09-26
634  2023-09-27
635  2023-09-28
636  2023-09-29
637  2023-09-30

[638 rows x 1 columns]>

In [18]:
data.isnull().sum()

Date    0
dtype: int64

In [23]:
data.iloc[0:100]

          Date
0   2022-01-01
1   2022-01-02
2   2022-01-03
3   2022-01-04
4   2022-01-05
..         ...
95  2022-04-06
96  2022-04-07
97  2022-04-08
98  2022-04-09
99  2022-04-10

[100 rows x 1 columns]